// Задача 01:
// Напишите программу, которрая запрашивает у пользователя
// вес в килограммах и конвертирует его в фунты. В килограмме 2,2 фунта

/*
prompt() - для получения данных от пользователя
parseInt() - переводит строковые данные в числовые
* - умножение
** - возведение в степень
alert() - чтобы вывести результат

Как будем решать:
Получить первое число
Получить второе число

Возвести в квадрат первое число 
и вывести квадрат первого числа
Возвести в квадрат второе 
и вывести квадрат второго числа





var firstNumberString = prompt ("введите первое число");
var secondNumberString = promt ("введите второе число")


// из строковых значений перевели в числовые
var firstNumber = parseInt (firstNumberString)
var secondNumber = parseInt (secondNumberString)

// возведение в квадрат, два варианта : умножить на себя и возвести в 2 степень
var squareOfFirstNumber = firstNumber * firstNumber;
var squareOfFSecondNumber = secondNumber ** 2;
*/